#language: ru

Функционал: Выбор подготовительного курса по цене

  Сценарий: поиск самого дорого подготовительного курса
    Пусть Выбран браузер chrome
    И Открыта главная страница в браузере
    * Выбрана категория Подготовительные курсы
    * курсы развернуты 1 раз
    Тогда Найден самый дорогой курс

  Сценарий: поиск самого дешевого подготовительного курса
    Пусть Выбран браузер chrome
    И Открыта главная страница в браузере
    * Выбрана категория Подготовительные курсы
    * курсы развернуты 1 раз
    Тогда Найден самый дешевый курс
